
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>لغة بايثون 3.7 متوفرة اﻵن في فيدورا · مجلة فيدورا</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="continuous-deployment-github-python.html" />
    
    
    <link rel="prev" href="gnome-3-28-released-coming-fedora-28.html" />
    

    
        <link rel="shortcut icon" href='../https:/fedoramagazine.org/wp-content/themes/fedoramagazine-theme-0.09/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../https:/fedoramagazine.org/wp-content/themes/fedoramagazine-theme-0.09/favicon.ico' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="improve-python-projects-mypy.html">
            
                <a href="improve-python-projects-mypy.html">
            
                    
                    حسِّن مشاريع بايثون باستخدام mypy
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="add-fonts-fedora.html">
            
                <a href="add-fonts-fedora.html">
            
                    
                    كيف تضيف خطوطاً جديدة إلى فيدورا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="gnome-3-28-released-coming-fedora-28.html">
            
                <a href="gnome-3-28-released-coming-fedora-28.html">
            
                    
                    الإصدار 3.28 من جنوم أُصدِر وسيأتي قريباً مع فيدورا 28
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="python-3-7-now-available-in-fedora.html">
            
                <a href="python-3-7-now-available-in-fedora.html">
            
                    
                    لغة بايثون 3.7 متوفرة اﻵن في فيدورا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="continuous-deployment-github-python.html">
            
                <a href="continuous-deployment-github-python.html">
            
                    
                    إجراء عمليّة نشر متواصِل مع جيتهاب وبايثون
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >لغة بايثون 3.7 متوفرة اﻵن في فيدورا</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x644;&#x63A;&#x629;-&#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646;-37-&#x645;&#x62A;&#x648;&#x641;&#x631;&#x629;-&#x627;&#xFEF5;&#x646;-&#x641;&#x64A;-&#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627;">&#x644;&#x63A;&#x629; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7 &#x645;&#x62A;&#x648;&#x641;&#x631;&#x629; &#x627;&#xFEF5;&#x646; &#x641;&#x64A; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627;</h1>
<p><img src="https://fedoramagazine.org/wp-content/uploads/2018/03/python37-945x400.jpg"></p>
<p>&#x623;&#x64F;&#x635;&#x62F;&#x650;&#x631;&#x64E;&#x62A; &#x627;&#x644;&#x646;&#x633;&#x62E;&#x629; &#x627;&#x644;&#x62A;&#x62C;&#x631;&#x64A;&#x628;&#x64A;&#x651;&#x64E;&#x629; &#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A;&#x629; &#x645;&#x646; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; 3.7 &#x641;&#x64A; 28 &#x634;&#x628;&#x627;&#x637; &#x639;&#x627;&#x645; 2018. &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x639;&#x644;&#x649; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x625;&#x635;&#x644;&#x627;&#x62D;&#x627;&#x62A;&#x60C; &#x648;&#x639;&#x644;&#x649; &#x648;&#x62C;&#x647; &#x627;&#x644;&#x62E;&#x635;&#x648;&#x635;&#x60C; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x627;&#x62A; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x627;&#x644;&#x645;&#x62A;&#x627;&#x62D;&#x629; &#x644;&#x644;&#x627;&#x62E;&#x62A;&#x628;&#x627;&#x631;. &#x644;&#x627; &#x64A;&#x62A;&#x648;&#x641;&#x631; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x627;&#x644;&#x645;&#x633;&#x628;&#x642; (&#x627;&#x644;&#x62A;&#x62C;&#x631;&#x64A;&#x628;&#x64A;) &#x645;&#x646; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7 &#x639;&#x644;&#x649; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627; &#x627;&#x644;&#x645;&#x62A;&#x62F;&#x62D;&#x631;&#x62C;&#x629; (Rawhide) &#x648;&#x62D;&#x633;&#x628;&#x60C; &#x628;&#x644; &#x648;&#x639;&#x644;&#x649; &#x62C;&#x645;&#x64A;&#x639; &#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627; &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649;. &#x623;&#x643;&#x645;&#x644; &#x627;&#x644;&#x642;&#x631;&#x627;&#x621;&#x629; &#x644;&#x645;&#x639;&#x631;&#x641;&#x629; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F;.</p>
<h2 id="&#x627;&#x644;&#x62A;&#x62B;&#x628;&#x64A;&#x62A;-&#x648;&#x627;&#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x627;&#x62A;">&#x627;&#x644;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x648;&#x627;&#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x627;&#x62A;</h2>
<p>&#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7 &#x639;&#x644;&#x649; &#x646;&#x633;&#x62E;&#x629; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627; &#x645;&#x62F;&#x639;&#x648;&#x645;&#x629;&#x60C; &#x641;&#x642;&#x637; &#x642;&#x645; &#x628;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x647;&#x630;&#x627; &#x627;&#x644;&#x623;&#x645;&#x631;:</p>
<pre><code>sudo dnf install python37
</code></pre><p>&#x648;&#x645;&#x646; &#x62B;&#x645; &#x646;&#x64E;&#x641;&#x650;&#x630; &#x627;&#x644;&#x623;&#x645;&#x631; <code>python3.7</code> &#x644;&#x62A;&#x62E;&#x62A;&#x628;&#x631; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x629;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x623;&#x64A;&#x636;&#x627;&#x64B; <a href="https://developer.fedoraproject.org/tech/languages/python/python-installation.html#using-virtualenv" target="_blank">&#x625;&#x646;&#x634;&#x627;&#x621; &#x628;&#x64A;&#x626;&#x629; &#x625;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629;</a> &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x60C; &#x623;&#x648; &#x625;&#x636;&#x627;&#x641;&#x629; <code>py37</code> &#x625;&#x644;&#x649; &#x645;&#x644;&#x641; <a href="https://developer.fedoraproject.org/tech/languages/python/multiple-pythons.html#getting-it-and-running-it-all-with-tox" target="_blank">tox.ini</a> &#x627;&#x644;&#x62E;&#x627;&#x635; &#x628;&#x645;&#x634;&#x631;&#x648;&#x639;&#x643; &#x648;&#x628;&#x62F;&#x621; &#x627;&#x62E;&#x62A;&#x628;&#x627;&#x631; &#x627;&#x644;&#x646;&#x633;&#x62E;&#x629; &#x627;&#x644;&#x637;&#x627;&#x632;&#x62C;&#x629; &#x645;&#x646; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646;:</p>
<pre><code>$ python3.7 -m venv venv
$ . venv/bin/activate
(venv) $ python --version
Python 3.7.0b2
</code></pre><p>&#x644;&#x627; &#x62A;&#x648;&#x62C;&#x62F; &#x645;&#x643;&#x62A;&#x628;&#x627;&#x62A; &#x625;&#x636;&#x627;&#x641;&#x64A;&#x629; &#x644;&#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7 &#x645;&#x64F;&#x62D;&#x632;&#x64E;&#x645;&#x650;&#x629; &#x641;&#x64A; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627; &#x628;&#x639;&#x62F;. &#x628;&#x627;&#x644;&#x631;&#x63A;&#x645; &#x645;&#x646; &#x630;&#x644;&#x643;&#x60C; &#x643;&#x644; &#x645;&#x627; &#x62A;&#x631;&#x64A;&#x62F; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x648;&#x641;&#x64A;&#x631;&#x647; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <a href="https://developer.fedoraproject.org/tech/languages/python/python-installation.html#using-virtualenv" target="_blank">virtualenv &#x648; pip</a>:</p>
<pre><code>(venv) $ python -m pip install requests  # or any other package
Collecting requests
  Using cached requests-2.18.4-py2.py3-none-any.whl
Collecting idna&lt;2.7,&gt;=2.5 (from requests)
  Using cached idna-2.6-py2.py3-none-any.whl
Collecting certifi&gt;=2017.4.17 (from requests)
  Using cached certifi-2018.1.18-py2.py3-none-any.whl
Collecting urllib3&lt;1.23,&gt;=1.21.1 (from requests)
  Using cached urllib3-1.22-py2.py3-none-any.whl
Collecting chardet&lt;3.1.0,&gt;=3.0.2 (from requests)
  Using cached chardet-3.0.4-py2.py3-none-any.whl
Installing collected packages: idna, certifi, urllib3, chardet, requests
Successfully installed certifi-2018.1.18 chardet-3.0.4 idna-2.6 requests-2.18.4 urllib3-1.22
</code></pre><h2 id="&#x645;&#x64A;&#x632;&#x629;-&#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646;-37-&#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x629;-&#x635;&#x646;&#x648;&#x641;-&#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;">&#x645;&#x64A;&#x632;&#x629; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7 &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x629;: &#x635;&#x646;&#x648;&#x641; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;</h2>
<p>&#x625;&#x644;&#x64A;&#x643; &#x645;&#x62B;&#x627;&#x644; &#x639;&#x644;&#x649; &#x625;&#x62D;&#x62F;&#x649; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x627;&#x62A; &#x627;&#x644;&#x631;&#x627;&#x626;&#x639;&#x629; &#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; 3.7.</p>
<p>&#x643;&#x645; &#x645;&#x631;&#x651;&#x64E;&#x629; &#x643;&#x62A;&#x628;&#x62A; <code>self.attribute = attribute</code> &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; <code>__init__</code>&#x61F; &#x633;&#x64A;&#x643;&#x648;&#x646; &#x62C;&#x648;&#x627;&#x628; &#x63A;&#x627;&#x644;&#x628;&#x64A;&#x651;&#x64E;&#x629; &#x645;&#x628;&#x631;&#x645;&#x62C;&#x64A; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646;: &quot;&#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x631;&#x627;&#x62A;&quot;. &#x645;&#x639; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>__repr__</code> &#x648;&#x62F;&#x639;&#x645; &#x627;&#x644;&#x645;&#x648;&#x627;&#x632;&#x646;&#x627;&#x62A; (comparisons)&#x60C; &#x64A;&#x648;&#x62C;&#x62F; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x637;&#x631;&#x642; &#x627;&#x644;&#x645;&#x62A;&#x62F;&#x627;&#x648;&#x644;&#x629; &#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x635;&#x646;&#x641; &#x64A;&#x62D;&#x648;&#x64A; &#x641;&#x642;&#x637; &#x639;&#x644;&#x649; &#x62D;&#x641;&#x646;&#x629; &#x645;&#x646; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x64A;&#x62D;&#x644; &#x645;&#x634;&#x631;&#x648;&#x639; <a href="https://pypi.python.org/pypi/attrs/" target="_blank">attrs</a> &#x627;&#x644;&#x645;&#x645;&#x62A;&#x627;&#x632; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x634;&#x643;&#x644;&#x627;&#x62A;. &#x627;&#x644;&#x622;&#x646; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x641;&#x631;&#x639;&#x64A;&#x629; &#x645;&#x646; &#x623;&#x641;&#x643;&#x627;&#x631; &#x645;&#x634;&#x631;&#x648;&#x639; attrs &#x627;&#x62E;&#x62A;&#x64A;&#x631;&#x62A; &#x628;&#x639;&#x646;&#x627;&#x64A;&#x629; &#x644;&#x64A;&#x62A;&#x645; &#x648;&#x636;&#x639;&#x647;&#x627; &#x641;&#x64A; &#x645;&#x643;&#x62A;&#x628;&#x629; &#x642;&#x64A;&#x627;&#x633;&#x64A;&#x651;&#x64E;&#x629;.</p>
<p>&#x625;&#x644;&#x64A;&#x643; &#x645;&#x62B;&#x627;&#x644; &#x639;&#x646; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x629; &#x628;&#x634;&#x643;&#x644; &#x639;&#x645;&#x644;&#x64A;:</p>
<pre><code>from dataclasses import dataclass

@dataclass
class Point:
    x: float
    y: float
    z: float = 0.0

&gt;&gt;&gt; p = Point(1.5, 2.5)
&gt;&gt;&gt; print(p)
Point(x=1.5, y=2.5, z=0.0)
</code></pre><p>&#x644;&#x627;&#x62D;&#x638; &#x623;&#x646;&#x651;&#x64E; &#x623;&#x646;&#x648;&#x627;&#x639; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x648;&#x636;&#x639;&#x62A; &#x644;&#x63A;&#x631;&#x636; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x64A; &#x641;&#x642;&#x637;. &#x644;&#x646; &#x64A;&#x62A;&#x645; &#x641;&#x62D;&#x635;&#x647;&#x627; &#x62E;&#x644;&#x627;&#x644; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x631;&#x646;&#x627;&#x645;&#x62C;. &#x648;&#x644;&#x643;&#x646; &#x628;&#x627;&#x644;&#x631;&#x63A;&#x645; &#x645;&#x646; &#x630;&#x644;&#x643;&#x60C; &#x633;&#x64A;&#x62A;&#x645; &#x641;&#x62D;&#x635;&#x647;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x62F;&#x642;&#x642; &#x646;&#x648;&#x639;&#x64A; &#x633;&#x627;&#x643;&#x646; (static type checker) &#x645;&#x62B;&#x644; <a href="https://fedoramagazine.org/improve-python-projects-mypy/" target="_blank">mypy</a>. &#x635;&#x646;&#x648;&#x641; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; (Data Classes) &#x645;&#x648;&#x62B;&#x642;&#x629; &#x62D;&#x627;&#x644;&#x64A;&#x627;&#x64B; &#x641;&#x64A; <a href="https://www.python.org/dev/peps/pep-0557/" target="_blank">&#x625;&#x642;&#x62A;&#x631;&#x627;&#x62D; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x627;&#x644;&#x62A;&#x639;&#x632;&#x64A;&#x632;&#x64A; &#x631;&#x642;&#x645; 557</a>. &#x625;&#x630;&#x627; &#x623;&#x62D;&#x633;&#x633;&#x62A; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x645;&#x643;&#x62A;&#x628;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x651;&#x64E;&#x629; &#x636;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x623;&#x641;&#x642; (&#x645;&#x62D;&#x62F;&#x648;&#x62F;&#x629;)&#x60C; &#x641;&#x62A;&#x630;&#x643;&#x631; &#x623;&#x646;&#x651;&#x64E; &#x630;&#x644;&#x643; &#x645;&#x642;&#x635;&#x648;&#x62F;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62F;&#x627;&#x626;&#x645;&#x627;&#x64B; &#x627;&#x644;&#x62A;&#x62D;&#x648;&#x651;&#x644; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x643;&#x62A;&#x628;&#x629; <a href="https://pypi.python.org/pypi/attrs/" target="_blank">attrs</a> &#x625;&#x630;&#x627; &#x627;&#x62D;&#x62A;&#x62C;&#x62A; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x627;&#x62A;.</p>
<p>&#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x629; &#x648;&#x63A;&#x64A;&#x631;&#x647;&#x627; &#x645;&#x646; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x627;&#x62A; &#x633;&#x62A;&#x623;&#x62A;&#x64A; &#x645;&#x639; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;. &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; 3.7 
<a href="https://fedoraproject.org/wiki/Changes/Python3.7" target="_blank">&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A; &#x641;&#x64A; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627; 29</a>. &#x625;&#x630;&#x627; &#x648;&#x62C;&#x62F;&#x62A; &#x623;&#x64A; &#x639;&#x644;&#x651;&#x629;&#x60C; &#x64A;&#x631;&#x62C;&#x649; &#x627;&#x644;&#x62A;&#x628;&#x644;&#x64A;&#x63A; &#x639;&#x646;&#x647;&#x627; &#x641;&#x64A; <a href="https://bugz.fedoraproject.org/python37" target="_blank">&#x645;&#x628;&#x644;&#x651;&#x63A; &#x639;&#x644;&#x644; &#x641;&#x64A;&#x62F;&#x648;&#x631;&#x627;</a> &#x623;&#x648; &#x645;&#x628;&#x627;&#x634;&#x631;&#x629;&#x64B; &#x641;&#x64A; <a href="https://bugs.python.org/" target="_blank">&#x627;&#x644;&#x645;&#x646;&#x628;&#x639;</a>. &#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x644;&#x62F;&#x64A;&#x643; &#x623;&#x64A; &#x633;&#x624;&#x627;&#x644;&#x60C; &#x623;&#x633;&#x623;&#x644; &#x627;&#x644;&#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x627;&#x644;&#x645;&#x62E;&#x62A;&#x635;&#x629; &#x628;&#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x639;&#x644;&#x649; <a href="mailto:python-devel@lists.fedoraproject.org" target="_blank">python-devel@lists.fedoraproject.org</a> &#x623;&#x648; &#x642;&#x645; &#x628;&#x632;&#x64A;&#x627;&#x631;&#x629; &#x642;&#x646;&#x627;&#x629; IRC &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; Freendoe &#x639;&#x644;&#x649; <a href="https://webchat.freenode.net/?channels=#fedora-python" target="_blank">#fedora-python</a>.</p>
<p>&#x627;&#x644;&#x645;&#x635;&#x62F;&#x631;: <a href="https://fedoramagazine.org/python-3-7-now-available-in-fedora/" target="_blank">https://fedoramagazine.org/python-3-7-now-available-in-fedora/</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="gnome-3-28-released-coming-fedora-28.html" class="navigation navigation-prev " aria-label="Previous page: الإصدار 3.28 من جنوم أُصدِر وسيأتي قريباً مع فيدورا 28">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="continuous-deployment-github-python.html" class="navigation navigation-next " aria-label="Next page: إجراء عمليّة نشر متواصِل مع جيتهاب وبايثون">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"لغة بايثون 3.7 متوفرة اﻵن في فيدورا","level":"1.5","depth":1,"next":{"title":"إجراء عمليّة نشر متواصِل مع جيتهاب وبايثون","level":"1.6","depth":1,"path":"docs/continuous-deployment-github-python.md","ref":"docs/continuous-deployment-github-python.md","articles":[]},"previous":{"title":"الإصدار 3.28 من جنوم أُصدِر وسيأتي قريباً مع فيدورا 28","level":"1.4","depth":1,"path":"docs/gnome-3-28-released-coming-fedora-28.md","ref":"docs/gnome-3-28-released-coming-fedora-28.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"https://fedoramagazine.org/wp-content/themes/fedoramagazine-theme-0.09/favicon.ico","bookmark":"https://fedoramagazine.org/wp-content/themes/fedoramagazine-theme-0.09/favicon.ico"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"مجلة فيدورا","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/python-3-7-now-available-in-fedora.md","mtime":"2018-03-21T04:27:54.888Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-31T14:19:28.124Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

